{"id":128606,"date":"2019-06-03T09:13:08","date_gmt":"2019-06-03T06:13:08","guid":{"rendered":"http:\/\/mylivia.com\/?p=128606"},"modified":"2020-11-24T16:15:32","modified_gmt":"2020-11-24T14:15:32","slug":"how-to-relieve-the-stress-of-travelling-on-your-period","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/how-to-relieve-the-stress-of-travelling-on-your-period\/","title":{"rendered":"How to Relieve The Stress of Travelling on Your Period"},"content":{"rendered":"\n<figure class=\"wp-block-image is-resized\"><img src=\"http:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/tim-gouw-ScWvHUtQca4-unsplash.jpg\" alt=\"\" class=\"wp-image-128914\" width=\"1126\" height=\"751\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/tim-gouw-ScWvHUtQca4-unsplash.jpg 4505w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/tim-gouw-ScWvHUtQca4-unsplash-300x200.jpg 300w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/tim-gouw-ScWvHUtQca4-unsplash-768x512.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/tim-gouw-ScWvHUtQca4-unsplash-1024x683.jpg 1024w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/tim-gouw-ScWvHUtQca4-unsplash-600x400.jpg 600w\" sizes=\"(max-width: 1126px) 100vw, 1126px\" \/><\/figure>\n\n\n\n<p class=\"has-text-align-center has-small-font-size\">Photo by Tim Gouw<\/p>\n\n\n\n<p>You’ve got your dream holiday booked; accommodation paid for and your bags are ready for a week of jam-packed activities in your ideal location. Then the worst happens – the day before you’re due to get on the plane, your period comes a week early. Don’t fret; your trip is most definitely not ruined! With just a little bit of planning you’ll be ready to enjoy your time away; it will almost be as if you didn’t even have your period (okay, we’re exaggerating just a tad). We’ve put together the ultimate guide to ensure your trip is nothing but smooth sailing &#8211; periods or not, we’ve got you covered. <\/p>\n\n\n\n<h3><strong>Don’t Stress!<\/strong><\/h3>\n\n\n\n<p>Stress can be a trigger for early or late periods as your body’s regular hormonal balance can be disrupted, resulting in a delayed ovulation. As a pre-emptive measure, do your best to keep your stress levels to a minimum in the weeks leading up to your holiday, and while away. If you can avoid altering your normal cycle by keeping calm this will assist in preventing any surprises while on holidays. Excessive drinking and minimal sleep can all contribute to increased stress, as can worrying prior to leaving. Meditation, eating healthy and keeping a regular sleeping pattern are all important for keeping a positive and stress-free mind. Healthy mind, healthy body!<\/p>\n\n\n\n<h3>Pack Wisely<\/h3>\n\n\n\n<p> Before going away on trips create a checklist to pack for the possibility of getting your monthlies, and also be sure to prepare for the potential accompanying pain. Travelling on your period will feel like a breeze if you pack these items.<\/p>\n\n\n\n<ul><li>Bring a good range and amount of sanitary products – pads, tampons, or menstrual cups, based on your personal preferences. Depending on your destination certain sanitary products such as tampons may not be easily available. In China pads can be sourced without difficulty, however tampons will be much more of a mission as only <a href=\"https:\/\/news.un.org\/en\/story\/2019\/03\/1034131\">2% of women who menstruate use them for sanitary needs<\/a>, due to health concerns and social beliefs.<a href=\"http:\/\/www.herreport.org\/feminine-hygiene-products-around-the-world\/\"><\/a><\/li><li>Remember to pack <a href=\"https:\/\/mylivia.com\/product\/livia-kit\/\">Livia<\/a> to ensure that your holiday won’t consist of you being stuck in your hotel bed, dying of pain. Due to its small compact size Livia can be worn anywhere, at anytime of the day, so there’s no excuse for letting pain hold you back!<\/li><li>Bring comfy clothing. Bloating, bleeding and being generally bothered do not mix well with tight, restrictive clothing. Pack a few comfortable outfits such as loose pants and t-shirts for the plane &amp; travelling that will allow your body to breathe and feel at home.<\/li><li>Stock up on hand sanitizer. Having your period can be messy, especially while travelling, if you are the kind of person to stray off the beaten track. You may not always have access to running water or soap when needing to change sanitary items, so to keep germs away pack a good antibacterial hand sanitizer.<\/li><\/ul>\n\n\n\n<h3><strong>Drink Lots of Water<\/strong><\/h3>\n\n\n\n<p>Hydration is important! If you’re planning on being very active during your trip you’re at a higher risk of feeling sick if you get your period. A sudden change in climate can also take toll on your body, so keeping your fluids up will assist with the adjustment and also minimize the risk of heatstroke in warmer climates.<\/p>\n\n\n\n<h3><strong>Be Mindful While in Transit<\/strong><\/h3>\n\n\n\n<p>There’s nothing more uncomfortable than having your period while in transit, especially on long flights, plane rides and road trips. Getting comfortable is impossible, it feels like you’re leaking into your underwear and of course, the pain makes staying in the same awkward position very difficult. This is where <a href=\"https:\/\/mylivia.com\/product\/livia-kit\/\">Livia<\/a> is a traveller’s best friend. Make sure to pack Livia in your carry-on luggage or handbag to keep it in easy reach when the pain is at its worst. Livia will reduce the discomfort of travelling while on your period and help you get some much-needed sleep on long transit journeys. Getting up and walking around regularly on long flights will help to maintain the blood flow, and always set a timer to change your tampon to prevent the possibility of <a href=\"https:\/\/www.betterhealth.vic.gov.au\/health\/conditionsandtreatments\/toxic-shock-syndrome-tss\">toxic shock syndrome<\/a>.<\/p>\n\n\n\n<h3><strong>Schedule in Some Daily Light Exercise<\/strong><\/h3>\n\n\n\n<p> You’ve got your period, <em>ugh<\/em>, and coming up are days with back-to-back activities planned. The period pain has eased, thanks to Livia, but you’re still feeling a little sluggish and unmotivated. Light exercise is known to not only assist in relieving cramps, but also re-energizing the mind, which can prepare you for the busy days ahead. So muster up the energy to do 15 minutes of yoga or go for a quick jog. Getting the blood pumping will have both your mind and body ready to knock out the activities feeling revitalized and most of all, being able to have fun!<\/p>\n\n\n\n<h3><strong>Carry an Emergency Kit, Just in Case<\/strong><\/h3>\n\n\n\n<p>Periods aren’t always the most reliable thing, so being prepared with an emergency kit while travelling is vital. You never know if one day on your holiday while hiking up a mountain with no 7\/11 in sight Aunt Flo decides to come for an unexpected, and much-unwanted visit. Stocking a few liners, wet wipes (for freshening up on the go) and plastic resealable bags (for used products &amp; stained clothes in case there aren’t any trash cans around) will save you a lot of stress and make that unexpected visit a lot less awkward.<\/p>\n\n\n\n<h3><strong>Relax<\/strong><\/h3>\n\n\n\n<p>Holidays are meant to be not only about having fun and seeing amazing sights, but also chilling out. Give yourself some guilt-free time away from the busy scheduling to just relax in your hotel\/hostel\/airbnb\/tent and rest. We all know that sleeping is the best cure for any ailment, plus who doesn’t love a good midday nap – your menstruating body will thank you for it. If you’re struggling to get comfy try out the <a href=\"https:\/\/www.glamour.com\/story\/this-is-the-best-position-to-sleep-in-when-youre-on-your-period\">fetal position<\/a>, experts swear by it as being the best to relieve cramps and you’ll look super-cute while sleeping. Win-win!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Photo by Tim Gouw You’ve got your dream holiday booked;<\/p>\n","protected":false},"author":11,"featured_media":128914,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128606"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/11"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=128606"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128606\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/128914"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=128606"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=128606"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=128606"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}