{"id":128896,"date":"2019-07-15T12:00:05","date_gmt":"2019-07-15T09:00:05","guid":{"rendered":"http:\/\/mylivia.com\/?p=128896"},"modified":"2020-11-24T16:33:20","modified_gmt":"2020-11-24T14:33:20","slug":"8-ways-you-can-support-your-partner-during-that-time-of-the-month","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/8-ways-you-can-support-your-partner-during-that-time-of-the-month\/","title":{"rendered":"8 Ways You Can Support Your Partner During That Time Of The Month"},"content":{"rendered":"\n<div class=\"wp-block-image\"><figure class=\"alignleft size-medium is-resized\"><img src=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-G1kQ-pnNhgI-unsplash-200x300.jpg\" alt=\"\" class=\"wp-image-128906\" width=\"634\" height=\"951\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-G1kQ-pnNhgI-unsplash-200x300.jpg 200w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-G1kQ-pnNhgI-unsplash-768x1152.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-G1kQ-pnNhgI-unsplash-683x1024.jpg 683w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-G1kQ-pnNhgI-unsplash-600x900.jpg 600w\" sizes=\"(max-width: 634px) 100vw, 634px\" \/><\/figure><\/div>\n\n\n\n<p class=\"has-text-align-center has-small-font-size\">Photo by Ava Sol<\/p>\n\n\n\n<p>Whether you are someone who experiences\nperiods or not, at some point in your life you are likely to have a partner (or\nfriend) who is going through menstruation. Our society as a whole is an entire\nworld away from being the thoughtful, understanding community that we need it\nto be, and an important step for positive progression is teaching people how to\nbehave when their partner is suffering during menstruation.<\/p>\n\n\n\n<p>Gender isn’t relevant when it comes to\neducating yourself about your significant other’s cycles, and can make things\neasier when the crimson wave rides into town for those few days out of the\nmonth. Whether you have a cycle, are dating someone with a cycle, or both,\nbeing thoughtful doesn’t need to be taken for granted. Besides, who doesn’t\nlike being taken care of when they’re not feeling well?<\/p>\n\n\n\n<p>If you’re not someone who has a cycle I’m\nsure you’ve heard about the horrific experience that having a period can be.\nFor some (myself included), it can feel like there is a knife being repeatedly\nscraped along the insides of your abdomen. Definitely not a pleasant feeling,\nor something I would wish upon anyone. I’ve been lucky to have my mother and\n(mostly) helpful partners who have been understanding enough to assist me\nduring those few torturous days out of the month. But for everyone who hasn’t\ndated someone who bleeds up until this point, here’s what you need to know.<\/p>\n\n\n\n<h3><strong>Be Prepared<\/strong><\/h3>\n\n\n\n<p>Tracking your partner’s cycle is the best thing that a thoughtful partner can do, as it allows you to be ready for what your partner is about to go through. Being prepared also means being mindful of your partner’s moods and can allow you to take into consideration PMS before you decide to react negatively. Try using a period-tracking app that includes a partner sharing feature, which is designed especially to be shared with partners for increased emotional support during PMS days.<\/p>\n\n\n\n<h3><strong>Give In To Their Cravings…<\/strong><\/h3>\n\n\n\n<p>Cravings, we all have them. But for those who menstruate we know just how bad the cravings for certain foods can get, leading up to and during our period. Stock up on some chocolate, chips or ice-cream (or whatever their particular craving is) and allow your partner a night or two of bingeing, they’ll love you for it.<\/p>\n\n\n\n<h3><strong>…But Also Encourage A Fibre-Rich Diet<\/strong><\/h3>\n\n\n\n<p>Menstruation can cause constipation for some people, so to help your partner combat this uncomfortable feeling offer them food that is high in fibre. Lentils, brown rice, raspberries, pears, broccoli and chia seeds are all rich in fibre and can assist to relieve constipation. Try not to force your partner to eat these foods if they’re not feeling it as they may just be craving other foods. Not everyone who bleeds gets constipated, so be sure to check in with them first before you start planning three days’ worth of fibre-rich recipes.<\/p>\n\n\n\n<h3><strong>Be Emotionally Supportive<\/strong><\/h3>\n\n\n\n<p>If you are someone who doesn’t have their own cycle it is important to take a mature approach to menstruation, even if it does make you uncomfortable. Refrain from making inconsiderate jokes about your partner’s behaviour or telling them how you think they may feel. Listening is vital, your partner may not want to talk about how they are feeling, but if they do listen to any complains they may have without judgement. Your partner may not want any company, but check in first in a non-judgemental tone to see if they want to be alone. If they decide they do want to be alone respect your partner’s wishes but still maintain regular contact via text to let them know you’re thinking of them.<\/p>\n\n\n\n<h3><strong>Help To Ease The Pain<\/strong><\/h3>\n\n\n\n<p>Have your partner’s <a href=\"https:\/\/mylivia.com\/\">Livia<\/a> ready for when the pain hits, the drug-free solution to zapping away those horrible cramps! Dehydration can also trigger abdominal pain, so prepare a jug of water that can be easily reached and make sure to refill it when you notice it is running low. Getting out of the house can also help to ease PMS &amp; cramps through some light yoga and fresh air. A change of environment can sometimes be an unexpected cure, but don’t push your partner if they really don’t feel up to it.<\/p>\n\n\n\n<h3><strong>Netflix &amp; <s>Chill<\/s> Take Your Mind Off The Pain<\/strong><\/h3>\n\n\n\n<p>Distraction is one of the best remedies, so keeping your partner pre-occupied with their favourite shows will be sure to keep you in the good books, while spending some bonding time together. To keep in theme with your partner’s time of the month check out our list on Period Positive Films that will be sure to uplift their spirit with relatable narratives.<\/p>\n\n\n\n<h3><strong>Pamper &amp; Be Thoughtful<\/strong><\/h3>\n\n\n\n<p>Indulge your partner’s inner princess by giving them body massages and preparing hot baths with body salts and candles. Make dinner for the few days as your partner may be struggling with period pain and take on more of the household chores and errands. Anything that can take additional stress off their plate and allow them to relax. Even if your partner isn’t in a lot of pain, noticing your effort will make them feel appreciated.<\/p>\n\n\n\n<h3><strong>Be Patient<\/strong><\/h3>\n\n\n\n<p>This can be an extremely emotional time, for some more so than others. Everyone reacts differently to periods; keep this in mind when you may think that your partner is being unreasonable. And never, under any circumstance call people who are menstruating “crazy”, it’s just going to fuel the fire and make matters way worse. Don’t lose your temper, just know that things will pass and if you’re feeling frustrated try meditating or stepping out of the space. Before you know it the moment will pass, with both of your minds and relationship still intact. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Photo by Ava Sol Whether you are someone who experiences<\/p>\n","protected":false},"author":18,"featured_media":128906,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128896"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=128896"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128896\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/128906"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=128896"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=128896"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=128896"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}