{"id":128893,"date":"2019-07-08T11:54:34","date_gmt":"2019-07-08T08:54:34","guid":{"rendered":"http:\/\/mylivia.com\/?p=128893"},"modified":"2020-11-24T16:35:28","modified_gmt":"2020-11-24T14:35:28","slug":"from-taboo-to-celebrated-how-periods-are-perceived-around-the-world","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/from-taboo-to-celebrated-how-periods-are-perceived-around-the-world\/","title":{"rendered":"From Taboo To Celebrated: How Periods Are Perceived Around The World"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"628\" src=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-X8dM-gVEvG8-unsplash-1024x628.jpg\" alt=\"\" class=\"wp-image-128908\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-X8dM-gVEvG8-unsplash-1024x628.jpg 1024w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-X8dM-gVEvG8-unsplash-300x184.jpg 300w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-X8dM-gVEvG8-unsplash-768x471.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-X8dM-gVEvG8-unsplash-600x368.jpg 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p class=\"has-text-align-center has-small-font-size\">Photo by Ava Sol<\/p>\n\n\n\n<p>Periods. Ew, gross. Heard that before? You would think that periods would be seen as the most normal thing ever, considering that half the world’s population experience them. Despite the much-needed noise that has been generated in recent years regarding menstrual equity, there is still an incredible divide in attitudes towards periods worldwide.<\/p>\n\n\n\n<p>People who menstruate are still facing the burden of society’s negative stigma, being taught that silence is better than speaking up. And that is a sad and dangerous thing when it comes to your own body, especially when the average menstruating person has their period for 3000 days in a lifetime, an incredible amount of time to be silenced for.<\/p>\n\n\n\n<p>Geographical location can have a big impact on the way periods are experienced, attitudes varying in magnitude per mile. This stigma towards periods can have a monumental impact of the lives of people with periods, in some countries causing them to miss out on opportunities, be shunned from society, or in some horrible cases become a man’s property the moment the first period arrives. We took a trip around the globe, exploring the varying attitudes towards menstruation from the celebrated to completely outlawed.<\/p>\n\n\n\n<h3><strong>India<\/strong><\/h3>\n\n\n\n<p>Women and girls in India are shunned from participating in normal life and daily activities when on their period, being seen as dirty and unclean. They are not allowed to enter the kitchen, or to cook as there is the belief that they will contaminate the food and turn it to poison. In addition to the shame &amp; stigma, accessibility to menstrual products is a big issue. “In India alone, only 12 per cent of the entire population of bleeders have access to the products they need. I mean that&#8217;s dire poverty and the fact that we don&#8217;t talk about it is the reason why this happens,” activist Madame Gandhi shared with ABC podcast<a href=\"https:\/\/www.abc.net.au\/news\/health\/2017-09-30\/menstrual-cycle-taboo-holds-women-back\/8996526\"> Ladies We Need To Talk<\/a>. People in India don’t have access to affordable menstruation products, with a 12% tax on pads being imposed in 2017 as reported by <a href=\"https:\/\/edition.cnn.com\/2017\/06\/30\/opinions\/sanitary-pads-india\/index.html\">CNN<\/a>. As a result, women are turning to risky alternative methods to manage their menstrual flow including cloth scraps, ash, wood shavings and old newspapers.<\/p>\n\n\n\n<h3><strong>The United States<\/strong><\/h3>\n\n\n\n<p>Despite being a first world country, the United States still has a long way to go when it comes to menstrual equity. The tampon tax’ still exists in the majority of states, only being repealed in 15 states. The recent launch of the ‘Tax Free. Period’ campaign by female entrepreneurs is focusing on eliminating the tax in all 35 states, shifting the narrative of the movement to being an “illegal, discriminatory and, therefore unconstitutional matter”, according to <a href=\"https:\/\/www.forbes.com\/sites\/estrellajaramillo\/2019\/06\/11\/female-founders-call-tampon-tax-unconstitutional-and-put-a-deadline-on-reform\/#59a3dd2c25fe\">Forbes<\/a>. Placing menstruation products under ‘luxury items’ is not only discrimination; it increases the cost of these already-expensive products, making accessibility difficult and perpetuating the cycle of poverty.<\/p>\n\n\n\n<h3><strong>Afghanistan<\/strong><\/h3>\n\n\n\n<p>On the rare occasion that periods are mentioned in Afghanistan they are referred to as <em>zan marizi<\/em>, meaning “a woman’s illness”. A lack of education and cultural shame has created a longstanding taboo around the topic of menstruation, leading those who have just gotten their period to believe that there is something seriously wrong with them. “I was terrified, I thought I had turned into a bad akhlaq,” (translates roughly to a “bad person”) shares <a href=\"https:\/\/undark.org\/article\/afghanistan-menstruation-taboo\/\">Saini Hamidi<\/a>, a psychological counsellor in Kabul, Afghanistan.<a href=\"https:\/\/undark.org\/article\/afghanistan-menstruation-taboo\/\"> <\/a><\/p>\n\n\n\n<p>If the traumatic miseducation wasn’t enough, women with periods are also ostracised from society, not being allowed near food and sometimes being locked away, all habits that can have devastating mental &amp; physical effects on the person being neglected.<\/p>\n\n\n\n<h3><strong>Ghana<\/strong><\/h3>\n\n\n\n<p>In Ghana a girl’s first period is celebrated by the Akan community, seen as a time for the older women to provide guidance and mentorship over a large feast. The older woman shares her knowledge with the younger, providing information about menstruation, supplying pads and preparing the newly-menstruating person for her period. It is a beautiful, encouraging community tradition that instils awareness, self-acceptance and support.<\/p>\n\n\n\n<h3><strong>Nepal<\/strong><\/h3>\n\n\n\n<p>In Nepal the inhumane tradition of <a href=\"https:\/\/widerimage.reuters.com\/story\/banished-once-a-month\">chaupadi<\/a> that sees women who are menstruating being banished to live in outdoor huts, or with animals still continues in the country’s far and midwestern regions despite being outlawed in 2005. The women are left alone, without access to food and water and forced to brave the natural elements in unhygienic sheds. Chaupadi is not only an uncomfortable tradition for Nepalese women, but it is also dangerous and has lead to many deaths caused by illnesses developed in the unsanitary spaces, animal attacks or fires lit in unventilated areas. <\/p>\n\n\n\n<h3>Japan<\/h3>\n\n\n\n<p>Japan is a country that has contradicting attitudes towards menstruation. On one hand, there is a long-standing tradition that dictates how women cannot be sushi chefs as their sense of taste is apparently affected by menstruation. Women have been fighting back against these claims in recent years, starting their own restaurants in order to stop these misconceptions. On the contrary, Japan was the first country to introduce the concept of period leave in 1947. Period leave allows women to take time off to recover during that time of the month, although employers are not necessarily required to pay for their absence.<\/p>\n\n\n\n<h3>Bali<\/h3>\n\n\n\n<p>The Balinese host a ceremony called Menik Kelih when a girl first gets her period. The ceremony is a celebration to give blessings and “to ask God to bless and lead her into a good life. This can be done at the girl’s house or other place but not at Pura (place of worship) as menstruating women are forbidden to enter Pura,” Merthi Poedijono described to <a href=\"https:\/\/www.sbs.com.au\/topics\/life\/health\/article\/2016\/05\/27\/how-menstruating-women-are-treated-around-world\">SBS<\/a>. The Balinese may be recognising menstruation through a ceremony, but they still have a long way to go to remove the stigma associated with periods being dirty, or something that should stop people from entering sacred spaces.<\/p>\n\n\n\n<h3><strong>First Nations: Cree<\/strong><\/h3>\n\n\n\n<p>Menstruation or ‘moon cycle’ is\ncelebrated as a Cree person, indicating that you are in ceremony and\nexperiencing a sacred process. “When a Cree woman goes through the transition\nfrom girl to woman, there is the rite of passage called a berry fast. It&#8217;s a\nreally beautiful time and it&#8217;s really celebrated,”&nbsp; Rosaly shared in an article with<a href=\"https:\/\/www.womenshealthmag.com\/life\/a19974024\/periods-around-the-world\/\"> <\/a><a href=\"https:\/\/www.womenshealthmag.com\/life\/a19974024\/periods-around-the-world\/\">Women’s Health<\/a>.\nIf only the rest of the world could adopt this positive approach, stigma and\nshame would be removed and people with periods would be celebrated for the\npowerful beings they are.<\/p>\n\n\n<p><!--StartFragment--><\/p>\n<p><!--EndFragment--><\/p>","protected":false},"excerpt":{"rendered":"<p>Photo by Ava Sol Periods. Ew, gross. Heard that before?<\/p>\n","protected":false},"author":18,"featured_media":128908,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128893"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=128893"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128893\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/128908"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=128893"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=128893"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=128893"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}