{"id":128890,"date":"2019-06-17T11:23:23","date_gmt":"2019-06-17T08:23:23","guid":{"rendered":"http:\/\/mylivia.com\/?p=128890"},"modified":"2020-11-24T16:37:22","modified_gmt":"2020-11-24T14:37:22","slug":"we-answer-7-things-that-men-are-all-dying-to-ask-you-about-menstruation","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/we-answer-7-things-that-men-are-all-dying-to-ask-you-about-menstruation\/","title":{"rendered":"We Answer 7 Things That Men Are All Dying to Ask You About Menstruation"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"683\" src=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/priscilla-du-preez-WacbrU86JIw-unsplash-1024x683.jpg\" alt=\"\" class=\"wp-image-128912\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/priscilla-du-preez-WacbrU86JIw-unsplash-1024x683.jpg 1024w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/priscilla-du-preez-WacbrU86JIw-unsplash-300x200.jpg 300w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/priscilla-du-preez-WacbrU86JIw-unsplash-768x512.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/priscilla-du-preez-WacbrU86JIw-unsplash-600x400.jpg 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p class=\"has-text-align-center has-small-font-size\">Photo by Priscilla Du Preez<\/p>\n\n\n\n<p>Despite being 2019, the age of technological advancements and growing social awareness, there is still an incredible divide between the sexes, with certain topics being weirdly off limits to a large part of society. This includes the topic of menstruation – something that in most cases men will avoid discussing at any cost. Society has imposed a stigma surrounding the taboo subject, but that doesn’t mean that men aren’t dying to ask you about it, right?<\/p>\n\n\n\n<p>I decided to take this question to the streets, asking a range of men in my life what they would want to know about menstruation, if they could ask anything. The responses were hilarious and intriguing – turns out 50% of those surveyed cringed at the subject. “Actually, I think most men would not like to know anything about it,” my good friend told me when I asked him. My dad continued this sentiment asking, “Why do we want to think about unpleasant things for? I’m glad it’s you, not me going through it, to be honest.” This notion was contrasted with the response of another friend who stated, “I think I’m pretty well-informed about that topic,” and then proceeded to contribute a few questions. By the end of the survey, the list was full of a variety of amusing questions, which I managed to cut down to 7 gems.<\/p>\n\n\n\n<h3><strong>How much blood comes out during your period?<\/strong><\/h3>\n\n\n\n<p>To be honest this is a question that even I, someone who has lived with periods for 17+ years, only discovered the truth about in the last year. During menstruation, it feels like bucketfuls of blood are flooding out, but the reality is shockingly, a significantly small amount. The majority of women will lose <a href=\"https:\/\/www.nhs.uk\/conditions\/heavy-periods\/\">less than 16ml of blood<\/a> during their period; approximately 6-8 teaspoons is the estimated average. It’s mind-blowing how something that feels so monumental is actually less than a single shot of tequila.<\/p>\n\n\n\n<h2><strong>What feels better a tampon or a pad? Doesn’t it get annoying?<\/strong><\/h2>\n\n\n\n<p>This really varies depending on the person. According to a <a href=\"https:\/\/ehjournal.biomedcentral.com\/articles\/10.1186\/s12940-015-0043-6\">survey<\/a> conducted by the US Centers for Disease Control and Prevention, 62% of women prefer pads, while 42% use tampons.<a href=\"https:\/\/ehjournal.biomedcentral.com\/articles\/10.1186\/s12940-015-0043-6\"> <\/a><a href=\"https:\/\/ehjournal.biomedcentral.com\/articles\/10.1186\/s12940-015-0043-6\"><\/a> I personally prefer pads, as I have very heavy periods that are quite painful, so pads are the more comfortable choice. I use tampons occasionally as a last resort; if I have run out of supplies, or if I am on my last few days and am heading to the beach. I find tampons to be annoying – they are not only uncomfortable physically, but also mentally as I am constantly on edge about leakage and forgetting to take them out. Pads can get irritating when they gradually slip to the side of my underwear and require constant readjustment, but other than that they are relatively tolerable.<\/p>\n\n\n\n<h3><strong>How come you get so emotional?<\/strong><\/h3>\n\n\n\n<p>So firstly, I just want to say that there is <em>nothing wrong<\/em> with being emotional.\nNo-one wants to live in a world full of emotionless robots. Keeping that in\nmind, know that you are not alone – <a href=\"https:\/\/www.womenshealth.gov\/menstrual-cycle\/premenstrual-syndrome\">85% of women<\/a> experience at least one kind of\nPMS symptom on a regular basis.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.womenshealth.gov\/menstrual-cycle\/premenstrual-syndrome\"><\/a>As for the reason why periods can result in\nsome women being emotional wrecks (i.e, me), there are a range of reasons\nincluding:<\/p>\n\n\n\n<ul><li>Hormones such as <a href=\"https:\/\/www.womansday.com\/health-fitness\/womens-health\/a1605\/a-month-in-the-life-of-your-hormones-107587\/\">progesterone<\/a> fluctuating, resulting in mood swings.<a href=\"https:\/\/www.womansday.com\/health-fitness\/womens-health\/a1605\/a-month-in-the-life-of-your-hormones-107587\/\"><\/a><\/li><li>Serotonin levels plummeting at the beginning of your period, which has been linked to cravings, depression and general crabbiness.<\/li><li>The pain factor. Periods aren’t pleasant; they’re painful, annoying afflictions that can make the cheeriest person hate the world. No one likes pain, so can you really expect us to be happy about it?<\/li><li>Losing sleep. I’ve had numerous sleepless nights where I spent hours tossing and turning, writhing in pain because even my ultra-strong painkillers were useless against the internal torture. That was until I got my <a href=\"https:\/\/mylivia.com\/product\/livia-kit\/\">Livia<\/a>; now sleeping isn’t a problem. As we all know that without a good night’s sleep you’re bound to end up irritated, tired and moody.<\/li><\/ul>\n\n\n\n<h3><strong>Is it the eggs that come out with the blood?<\/strong><\/h3>\n\n\n\n<p>Yes, but there is only one egg. Part of the body’s cycle for preparing a woman for pregnancy involves the release of natural hormones and chemicals to cause the ovaries to release one egg a month. If male sperm <a href=\"https:\/\/extendfertility.com\/blog\/periods-101\">doesn’t fertilize the egg<\/a> during ovulation then the uterus lining, the unfertilized egg and other fluids are all released during the menstrual period.<\/p>\n\n\n\n<h3><strong>How does the moon affect your period?<\/strong><\/h3>\n\n\n\n<p>For many generations women’s menstrual cycles have been linked to the lunar cycle due to their similar lengths – a menstrual cycle is 28 days and a lunar cycle lasts 29.5 days. The link between the two hasn’t been proven 100%, with various studies resulting in a range of contrasting evidence. It has been concluded that menstruation cycles do not sync with the lunar calendar, with <a href=\"https:\/\/helloclue.com\/articles\/cycle-a-z\/myth-moon-phases-menstruation\">7.5 million cycles<\/a> being analyzed that resulted in no correlation.<a href=\"https:\/\/helloclue.com\/articles\/cycle-a-z\/myth-moon-phases-menstruation\"> <\/a><a href=\"https:\/\/helloclue.com\/articles\/cycle-a-z\/myth-moon-phases-menstruation\"><\/a> It has, however, been suggested that moonlight may have an impact on menstrual cycles, with a <a href=\"https:\/\/www.myhormonology.com\/hormone-horoscope-does-the-moon-affect-your-menstrual-cycle\/\">2005 study from India<\/a> discovering that women who conceived while ovulating during the full moon are more likely to give birth to boys, while women who conceived three days prior to the full moon were more likely to give birth to girls. It hasn’t been determined if these were simply coincidences or not, as the researchers narrowed it down to a change in temperatures and vaginal fluids brought on by the moon’s changing phases. Superstition or not, it certainly makes menstruation seem like a more magical process now.<\/p>\n\n\n\n<h3><strong>How and why do women’s periods sync?<\/strong><\/h3>\n\n\n\n<p>This is another myth, one that I am personally a believer in. Hang around a group of women for long enough and you definitely start to notice that your menstrual cycles begin to align. Coincidence? Maybe, or are we just magical creatures that cannot be explained by science? There is the theory, generated in <a href=\"https:\/\/www.bbc.com\/news\/magazine-37256161\">1971 by a researcher called Martha McClintock<\/a> who determined that the syncing was a result of women’s pheromones interacting with each other after spending extended periods of time together. The idea was that the pheromones were unintentionally creating a tactic for women to gang up with each other against the possibility of a single ruling man. A female army challenging the rule of man? Sounds about right. This theory was later challenged by <a href=\"https:\/\/watermark.silverchair.com\/arr230.pdf?token=AQECAHi208BE49Ooan9kkhW_Ercy7Dm3ZL_9Cf3qfKAc485ysgAAAkAwggI8BgkqhkiG9w0BBwagggItMIICKQIBADCCAiIGCSqGSIb3DQEHATAeBglghkgBZQMEAS4wEQQMTNI84uT1AihhSYtIAgEQgIIB83VxKoBf-POLV39m4i5HF4GUkwjJC8HuSTzT3qP4Vy7kTYYm7agbCYPIQ18b3lLSjjgFUqcT-ewNzK8RLveiatjlZw9JTch3YNxairustKSuB1HCHjVnfV32fkrC5nxvEZv_4_ZSgdtv2vEP7cJH_NM4-rXJTyYoKnREXIY1XSsQIXvDgfcSHjRZK9jlzWNTmyWR-woINb75Mtff1azVWv2Jtm0syJ0KdcBivdCBAt_E5y78agKxsMFQ2KO9ZLirMuPl_q2C1-doxiBrgNLr73MEj9Nlit10wFZWkg6GJwXZ2rLgCi1dAN-z_V-0mw5a5OC_PFYknZ_DC8khUfmvV6YyT4Unuu5wARozNm7fOvW0M95YtXBZU9hVCCcPnjxlkXm0JzoBx-cwrrgTSFmsIyC9HJJNd8kx2MnjouWurWrN_fmfJ7Ori3DmqtjIDZEEkJBnAHuBlgy6Jn0hun_IuDfm6TWqhyERprTaB-2Y0yS4A5qV8ui7yHEMb8okBJK8d_YiETYYEaKaJbBGAlqv-jplgQYcTsSgFIvGv7HeXwtVS-3NHK62GDRB04VF22VgDURfkatrWhHGJyLMfDL54NtfgjmcuqmuVXPc0MVHhV--iHCDzJoML1Wu8FtF5u5JkPs9TPJYwzloilv5Ch5fg4JzL4c\">research<\/a> that put all these experiences down to being simply, chance.<\/p>\n\n\n\n<h3><strong>Why does the period pain threshold vary so vastly?<\/strong><\/h3>\n\n\n\n<p>Period pain can vary significantly from person to person, from bearable discomfort to crippling agony. <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK279324\/\">10 out of 100<\/a> women experience pain so unbearable that it affects their ability to carry out their usual activities.<\/p>\n\n\n\n<p>So, what’s the reason for the vast sliding scale? It’s not known exactly why the pain varies from woman to woman, but it is said to involve the body’s overproduction of prostaglandins, the hormone-like chemical messengers that influence pain perception. Other causes of extreme pain may also be endometriosis, where the tissue that lines the womb grows in other areas of the abdomen as well.<\/p>\n\n\n<p><!--StartFragment--><\/p>\n<p><!--EndFragment--><\/p>","protected":false},"excerpt":{"rendered":"<p>Photo by Priscilla Du Preez Despite being 2019, the age<\/p>\n","protected":false},"author":18,"featured_media":128912,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128890"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=128890"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128890\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/128912"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=128890"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=128890"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=128890"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}