{"id":128891,"date":"2019-06-24T11:33:59","date_gmt":"2019-06-24T08:33:59","guid":{"rendered":"http:\/\/mylivia.com\/?p=128891"},"modified":"2020-11-24T16:36:24","modified_gmt":"2020-11-24T14:36:24","slug":"shame-free-sisterhood-the-story-of-my-first-period","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/shame-free-sisterhood-the-story-of-my-first-period\/","title":{"rendered":"Shame Free Sisterhood: The Story of My First Period"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"608\" src=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/josefin-aED9rphM2iA-unsplash1-1024x608.jpg\" alt=\"\" class=\"wp-image-128905\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/josefin-aED9rphM2iA-unsplash1-1024x608.jpg 1024w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/josefin-aED9rphM2iA-unsplash1-300x178.jpg 300w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/josefin-aED9rphM2iA-unsplash1-768x456.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/06\/josefin-aED9rphM2iA-unsplash1-600x356.jpg 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p class=\"has-text-align-center has-small-font-size\">Photo by Josefin<\/p>\n\n\n\n<p>I was 13 when I got my first period. I recall feeling weirdly sick that day at school – nausea that I had never experienced before – and then coming home to discover my underwear was full of blood. This would be the first of many times that this would happen. I soon discovered how periods would enjoy springing themselves onto me, creeping up at the worst time and ruining some of my most prized underwear. We just can’t have nice things, can we?<\/p>\n\n\n\n<p>“I was wondering when you were going to get yours,” my older sister had commented as my mum pulled out a range of sanitary items (pads were my choice at the time), and showed me how to use them. I didn’t think too much of my period – extended family such as Aunts and my grandmothers would say that I was now “officially a woman”, but this didn’t mean much to me. That was until my period began to destroy my life. What was once a fleeting thought in the back of my mind quickly became my mortal enemy, and I soon realized I had no choice other than nurture my internal nemesis.<\/p>\n\n\n\n<p>First came the excruciating pain. This was a pain I had never experienced before in my life. An agonizing ache that felt something similar to having a knife angrily rip apart my abdomen. As soon as my first period arrived the paralyzing pain followed, and unfortunately it has gotten worse ever since. The pain is different for everyone – some ill-fated victims such as myself are the bearer of vicious period cycles. However, other girlfriends I’ve talked to have told me they barely feel anything during that time of the month. I like to refer to them as the ‘hashtag blessed’ bunch, gifted with divine uteruses of steel that I would trade mine for in a heartbeat. Period pain has haunted me since my teen years; there was the time just after I first got my period when I was visiting my grandmother’s house and was unable to leave the bath for hours as the pain was too overwhelming, to the moment when I was bedridden while travelling and had to miss a trip to the Eiffel Tower. How I wish I had access to <a href=\"https:\/\/mylivia.com\/product\/livia-kit\/\">Livia<\/a> back then.<\/p>\n\n\n\n<p>What followed shortly after was the shame. Any teen girl knows how sporadic their period can be – from hormonal changes to stress to dietary modifications, periods can come a few days (or even weeks!) late or early, leaving us all in some sticky situations (pun intended) from time to time. I’ve lost count of the amount of times I unexpectedly got my period while at school; completely unprepared, leaving my pale blue school uniform dress stained for the world to see. On numerous accounts I had to rush out of class clutching my dress, feeling that familiar trickle in my underwear and realizing that, <em>oh shit<\/em>, it’s come. Completely terrified with the shame of staining my uniform I would inconspicuously run to the office to change dresses, anxious that anyone might catch a glimpse of the blood-red patch. I didn’t want to risk spending my remaining high school years branded as ‘that period stain girl’. I’ve seen it happen, kids can be cruel. Going through your first period is difficult, it’s even harder when you’re an anxious teen who is still figuring out their body and trying to deal with the pressure of high school politics and bullying.<\/p>\n\n\n\n<p>The older I got the more I began to realize that despite the leers and taunting of peers, menstruation is a natural part of life; a rite of passage that no one should be made to feel ashamed or embarrassed about.&nbsp; We’ve all been there; caught in compromising situations where we wished we were invisible and the earth could just swallow us whole. Having a network of support is vital to reassure that there is nothing to be ashamed of – western society has thankfully come a long way from the 1950’s where ‘women’s business’ was a topic of conversation never to be uttered to a man, under any circumstances.<\/p>\n\n\n\n<p>Despite my experiences being embarrassing or shameful, I know how lucky I am to have grown up in a first world country like Australia, where periods aren’t shunned in the way that they are in other countries. In Nepal, menstruating women are forced to leave their homes and sleep outside in huts or sheds with cattle until their period is over, while in parts of India, women on their period are not allowed into sacred spaces such as temples, and are banished to unmanaged, unhygienic huts called a <em><a href=\"https:\/\/www.theguardian.com\/global-development\/2015\/dec\/22\/india-menstruation-periods-gaokor-women-isolated\">gaokor<\/a><\/em> during menstruation. I am fortunate to have had the unwavering support of my family and was graced with a mother who would happily discuss anything and everything from period flow to heat packs and the best pain-relieving methods.<\/p>\n\n\n\n<p>Not only are periods different for everyone, but they are also not gender-exclusive. Trans men can get their period, just as much as trans women may not. Menstruation is no longer defined by what gender the person is, and understanding that is a vital part of the all-inclusive sisterhood.<\/p>\n\n\n\n<p>I do hope that sharing my story and what I went through with my first period in my teens can encourage others to feel confident in themselves and their journey. Education and support can enable others to react positively, to fight against bullying and work to end the negative stigmas that are still attached to menstruation. No one can ever be fully prepared for their period, as everyone’s experience is unique, but the best thing that we can do is to create a loving, empathetic environment; a shame-free sisterhood.<\/p>\n\n\n<p><!--StartFragment--><\/p>\n<p><!--EndFragment--><\/p>","protected":false},"excerpt":{"rendered":"<p>Photo by Josefin I was 13 when I got my<\/p>\n","protected":false},"author":18,"featured_media":128905,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128891"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=128891"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128891\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/128905"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=128891"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=128891"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=128891"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}