{"id":128892,"date":"2019-07-01T11:36:15","date_gmt":"2019-07-01T08:36:15","guid":{"rendered":"http:\/\/mylivia.com\/?p=128892"},"modified":"2020-11-24T16:35:55","modified_gmt":"2020-11-24T14:35:55","slug":"6-books-that-explore-the-power-of-menstruation","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/6-books-that-explore-the-power-of-menstruation\/","title":{"rendered":"6 Books That Explore The Power Of Menstruation"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><img width=\"1024\" height=\"683\" src=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-RdE-KwXFLMA-unsplash-1024x683.jpg\" alt=\"\" class=\"wp-image-128910\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-RdE-KwXFLMA-unsplash-1024x683.jpg 1024w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-RdE-KwXFLMA-unsplash-300x200.jpg 300w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-RdE-KwXFLMA-unsplash-768x512.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/07\/ava-sol-RdE-KwXFLMA-unsplash-600x400.jpg 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p class=\"has-text-align-center has-small-font-size\">Photo by Ava Sol<\/p>\n\n\n\n<p>Periods are a powerful, sacred thing that a large amount of the world experiences. Despite this, there is unfortunately a serious lack of resources that promote menstruation and don’t present it as something to be ashamed of. Knowledge is power, and with that can come the desire to educate and share information to create a worldwide shame-free sisterhood where we celebrate our time of the month together.<\/p>\n\n\n\n<p>When I was an adolescent teenager prior to getting my first period there were no resources (that I knew of) available at my school. Periods weren’t discussed in any way other than a whisper to a teacher to let them know that you had to rush to the bathroom, because it was “that time of the month”. If there had been a curriculum in place that openly discussed menstruation then maybe I wouldn’t have felt such shame or embarrassment the few times that I discovered I had gotten my period in the middle of sports class. “I could just die,” I recall telling one of my close friends. Why? Because periods were seen as gross, dirty things that shouldn’t be talked about. There was no education, no normalisation that made me feel like what I was experiencing was okay. But the truth is that it was normal, there just wasn’t anyone letting me know that.<\/p>\n\n\n\n<p>Reading about periods and educating yourself is something that should happen at any age, not just before or while you’re experiencing your first period. Whether you’ve been menstruating for years, just started, or are the parents of a budding menstruator, educating yourself on the whole period of experience (pun intended) is important to stop the cycle of shame and let people with periods know that they are not alone. There is a support system out there, and despite the lack of resources, we are here to help each other.<\/p>\n\n\n\n<p>Here are a few of our picks that educate, promote, share and amuse in order to debunk myths surrounding menstruation, and focus on the right that we should all have to live equally with access to the products we deserve. Because we’re powerful beings and deserve nothing less!<\/p>\n\n\n\n<h3><strong>‘Heavy Flow’ Amanda Laird<\/strong><\/h3>\n\n\n\n<p>Challenging and breaking down menstruation myths, this must-read has been described by author, holistic nutritionist and feminist <a href=\"http:\/\/amandalaird.ca\/heavy-flow-breaking-the-curse-of-menstruation\/\">Amanda Laird<\/a>, as “the menstrual education you didn’t get in health class”.<\/p>\n\n\n\n<p>The book provides a crash course on the history of menstrual shame, examining how this has had a direct impact on women’s health &amp; wellness in the modern age. No more shame here, Amanda puts the reader at ease with her casual, relatable tone, making you feel like you’re learning pearls of wisdom from an older sister or friend.<\/p>\n\n\n\n<h3><strong>‘Periods Gone Public: Taking A Stand For Menstrual Equity’ &#8211; Jennifer Weiss-Wolf<\/strong><\/h3>\n\n\n\n<p>From the woman who coined the term ‘menstrual equity’, lawyer and vice-president at the Brennan Center For Justice, Jennifer Weiss-Wolf explores how periods are becoming a prominent political cause. Not only challenging the outdated stigma towards menstruation, Weiss-Wolf also puts forward an agenda of action to start the movement for menstrual equity. Chances are after reading this you’ll be ready to jump on the menstrual equity movement, it’s an inspiring book that will be sure to ignite the activist fire within all of us.<\/p>\n\n\n\n<h3><strong>‘Period: Twelve Voices Tell The Bloody Truth’ &#8211; Kate Farrell (Editor)<\/strong><\/h3>\n\n\n\n<p>This collection of twelve beautiful essays illustrate what it’s like to have a period from a diverse range of perspectives. Presenting topics that are rarely discussed within mainstream media (even less than menstruation itself is) &#8211; including what it&#8217;s like to be a trans man with a period as shared by Wiley Reading &#8211; this book will make you laugh, cry and cringe, reminding us all that there is not just one face of menstruation.<\/p>\n\n\n\n<h3><strong>‘Period Power: A Manifesto For The Menstrual Movement’ &#8211; Nadya Okamoto<\/strong><\/h3>\n\n\n\n<p>Period Power is an incredibly accessible, inclusive book for EVERYONE who experiences periods, removing gender from the menstruation language. Let’s say people who menstruate, not women, acknowledging that there is a world far beyond the cis-female experience of menstruation. Nadya Okamoto has long been a period advocate, starting from a young age when she founded Period: The Menstrual Movement, running for office to encourage period advocacy and give a voice to the period-positive movement.<\/p>\n\n\n\n<h3><strong>Her Blood Is Gold: Celebrating The Power of Menstruation &#8211; Lara Owen<\/strong><\/h3>\n\n\n\n<p>A classic in the realm of women’s spirituality and health, this book explores beliefs surrounding menstruation and encourages people to reclaim their cycle. Owen focuses on ways to make our periods physically, emotionally and spiritually healthy through monthly rituals that focus on the blessing of menstruation. Feel more productive during that time of the month? The crux of Owen’s writing is the idea that women are in their prime of creativity during menstruation and should take time off to indulge in their blessing. It is a beautiful idea that highlights people with periods as being powerful creatures that should be celebrated.<\/p>\n\n\n\n<h3><strong>‘Moon Mysteries’ &#8211; Nikiah Seeds &amp; Nao Sims<\/strong><\/h3>\n\n\n\n<p>Moon Mysteries explores the wisdom of ‘moon time’ through beautiful illustrations, personal stories and mystical teachings. and explores how you can track your own cycle. This book focuses on repairing the disconnect that we have had with our bodies for centuries, and provides words of wisdom as to how we can heal this divide. There are some charting templates included in the back of the book that provide you with some creative ways that you can chart your cycle. It’s a very hands-on personalised experience that will help you to get in touch with your body and discover what it spiritually means to have your period.<\/p>\n\n\n<p><!--StartFragment--><\/p>\n<p><!--EndFragment--><\/p>","protected":false},"excerpt":{"rendered":"<p>Photo by Ava Sol Periods are a powerful, sacred thing<\/p>\n","protected":false},"author":18,"featured_media":128910,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128892"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=128892"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128892\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/128910"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=128892"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=128892"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=128892"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}