{"id":128901,"date":"2019-08-18T12:15:04","date_gmt":"2019-08-18T09:15:04","guid":{"rendered":"http:\/\/mylivia.com\/?p=128901"},"modified":"2020-07-06T17:40:37","modified_gmt":"2020-07-06T14:40:37","slug":"9-reasons-that-you-might-miss-your-period-other-than-pregnancy","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/9-reasons-that-you-might-miss-your-period-other-than-pregnancy\/","title":{"rendered":"9 Reasons That You Might Miss Your Period (Other Than Pregnancy)"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img width=\"1024\" height=\"683\" src=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/08\/freshh-connection-ZyhjHpICm0E-unsplash-1024x683.jpg\" alt=\"Worrying\" class=\"wp-image-128913\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2019\/08\/freshh-connection-ZyhjHpICm0E-unsplash-1024x683.jpg 1024w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/08\/freshh-connection-ZyhjHpICm0E-unsplash-300x200.jpg 300w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/08\/freshh-connection-ZyhjHpICm0E-unsplash-768x512.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2019\/08\/freshh-connection-ZyhjHpICm0E-unsplash-600x400.jpg 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption>Photo by Freshh Connection<\/figcaption><\/figure>\n\n\n\n<p>The reproductive system is a miraculous\nthing. It is an organism that comes alive every month for the majority of\npeople that experience a cycle. Even more incredible than the reproductive\nsystem are the people who have to live with them. Despite the constant stresses\nassociated with menstrual bleeding that exist in the chaos of everyday life,\nsomehow they manage their monthly flows with as much or little ease as is\nhumanly possible. <\/p>\n\n\n\n<p>Even for those who bleed we have to\nremember that every person is different, and as a result everyone’s body\noperates uniquely. Some of us have our cycle at the same time every month, down\nto the exact day. For others, it may not be so predictable. And occasionally\nfor some, they don’t even happen at all. Most people will experience at least\none missed period in their lifetime, but if you’ve missed your period for 3\nmonths in a row then you’re experiencing amenorrhea, a condition that affects<a href=\"https:\/\/www.medicalnewstoday.com\/articles\/322893.php\"> 3-4%<\/a> of women.<a href=\"https:\/\/www.medicalnewstoday.com\/articles\/322893.php\"> <\/a><\/p>\n\n\n\n<p>Missing your\nperiod can be the result of numerous things, and it doesn’t always mean\npregnancy. So before you start panicking and pre-planning baby names make sure\nyou stop for a moment and check in with your body to determine if there may be\nsome other underlying issue. We’ve put together a list of 9 reasons that you\nmight miss your period, and none of them are pregnancy.<\/p>\n\n\n\n<h3><strong>New Periods<\/strong><\/h3>\n\n\n\n<p>It is common for\nyoung people who are just starting their period to have an irregular cycle. The\nnormal menstrual cycle lasts <a href=\"https:\/\/flo.health\/menstrual-cycle\/health\/period\/8-reasons-for-missed-periods-or-absence-of-menstruation\">21-35 days<\/a>\nin healthy people, but this is known to vary. For someone who has just gotten\ntheir period it can often happen that they have a few cycles and then go months\nwithout another one.<\/p>\n\n\n\n<h3><strong>Menopause<\/strong><\/h3>\n\n\n\n<p>Depending on your age, you may be coming\nup to menopause. Menopause is the total cessation of menstruation in a person’s\nlater life. Young menstruators, you all have quite a few years before you can\neliminate the pads and tampons from your shopping list! If you are under 40 and\nseem to be experiencing the symptoms you may be going through early or <a href=\"https:\/\/www.betterhealth.vic.gov.au\/health\/conditionsandtreatments\/premature-and-early-menopause\">premature menopause<\/a>\nand should consult your doctor.<\/p>\n\n\n\n<h3><strong>Contraceptives<\/strong><\/h3>\n\n\n\n<p>Just stopped the pill and noticed you’ve\nmissed your period? Starting or going off the pill can have an impact on your\ncycle. Birth control pills may cause a period to stop in some women. Once the\noral contraceptives are stopped, normal menstruation may return after some\ntime. In some cases, it may take up to <a href=\"https:\/\/www.healthline.com\/health\/womens-health\/why-is-my-period-late#birth-control\">6 months<\/a> for your cycle\nto return to normal again.<a href=\"https:\/\/www.healthline.com\/health\/womens-health\/why-is-my-period-late#birth-control\"> <\/a><\/p>\n\n\n\n<h3><strong>Medications<\/strong><\/h3>\n\n\n\n<p>There are certain medications that could\ncause a period to stop. If you’ve missed your period, consider that the reason\nmay be the drugs you’re ingesting. Any of these medications can cause a missed\nperiod: antidepressants, chemotherapy drugs, antipsychotic drugs, allergy\nmedicines and blood pressure drugs.<\/p>\n\n\n\n<h3><strong>Important Lifestyle Factors<\/strong><\/h3>\n\n\n\n<p>We all know that the way we live our\nlives ultimately has an impact on our bodies. Sometimes these lifestyle choices\nare unintentional and out of our control, other times it’s just a matter of\nself-awareness and personal adjustment to find the right mind\/body balance for\nyou.<\/p>\n\n\n\n<h3><strong>Change In Schedule<\/strong><\/h3>\n\n\n\n<p>Have a strict gym-work routine and then\nsuddenly call it quits? Your body might not handle that well and as a result\nact out in a number of ways. If you’re constantly changing your work schedule,\nor if your schedule is generally pretty inconsistent then your period may mimic\nthis and not come on time. Jetlag and constantly travelling can also cause your\ncycle to be pushed back by a few days or come earlier than expected.<\/p>\n\n\n\n<h3><strong>Stress<\/strong><\/h3>\n\n\n\n<p>Our brain truly is the boss of our body,\nand is constantly reminding us of it! There’s this super small chamber in the\nbrain, the size of an almond called the <a href=\"https:\/\/www.healthline.com\/human-body-maps\/hypothalamus\">hypothalamus<\/a>.\nThe magical nut-sized compartment that is the hypothalamus controls the\nhormones that send signals to the ovaries to regulate your monthly period. It\ncan literally inhibit or stimulate hormone secretion. If you’re experiencing\nmental stress and you miss a period, two or three, then this governing member\nmay be on strike! So take some time to chill out, de-stress and just breathe.\nBefore you know it your chill levels will be reigning and soon enough your\ncycle will normalise itself once again.<\/p>\n\n\n\n<h3><strong>Excessive Rigorous Exercise<\/strong><\/h3>\n\n\n\n<p>Working out for hours and hours on end\ncan have a negative impact on the body, causing it more harm than good if you\nare not exercising properly. Overexercising can cause a change in your<a href=\"https:\/\/www.verywellhealth.com\/reasons-you-missed-your-period-2757503\"> pituitary and thyroid<\/a>\nhormone<a href=\"https:\/\/www.verywellhealth.com\/reasons-you-missed-your-period-2757503\"> <\/a>levels, which can lead to an alteration in your menstrual cycle.<\/p>\n\n\n\n<h3><strong>Severe Illness<\/strong><\/h3>\n\n\n\n<p>There are certain chronic illnesses that\nmay have an impact on your cycle including diabetes, thyroid disease, ovarian\ncysts, polycystic ovarian syndrome (PCOS), liver diseases and pituitary tumors.\nOften your cycle may not return to normal until these conditions have been\nproperly treated, and it may take a while even after you have been completely\ncured.<\/p>\n\n\n\n<h3><strong>Weight Changes<\/strong><\/h3>\n\n\n\n<p>Experiencing fluctuating weight? This\ncould be a reason why you’ve missed your period. Being both severely overweight\nor underweight can affect how our body functions. Having a very <a href=\"https:\/\/www.verywellhealth.com\/reasons-you-missed-your-period-2757503\">high BMI<\/a> can be related\nto missed periods, and is usually resolved by losing weight.<a href=\"https:\/\/www.verywellhealth.com\/reasons-you-missed-your-period-2757503\"> <\/a><\/p>\n\n\n\n<p>People who are extremely underweight, particularly those with eating disorders such as anorexia or bulimia may often miss their period. Particularly in the cases where the body weight is about <a href=\"https:\/\/www.healthline.com\/health\/womens-health\/why-is-my-period-late#low-body-weight\">10<\/a> per cent under the normal range for your height, your body may stop being able to function properly, which can also result in ovulation ceasing.<a href=\"https:\/\/www.healthline.com\/health\/womens-health\/why-is-my-period-late#low-body-weight\"> <\/a><\/p>\n\n\n\n<h3><strong>When To Reach Out To Your Doc<\/strong><\/h3>\n\n\n\n<p>If missing your period has become a\nregular occurrence it’s best to check in with the doc to see what’s up with\nyour bod. Even if you’re just going through a change in the pattern of your\nregular periods there’s no harm to bring it up, better to put your mind at ease\nthan to cause unnecessary stress for yourself. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>The reproductive system is a miraculous thing. It is an<\/p>\n","protected":false},"author":18,"featured_media":128913,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128901"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=128901"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/128901\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/128913"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=128901"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=128901"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=128901"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}