{"id":263975,"date":"2020-09-10T13:56:17","date_gmt":"2020-09-10T10:56:17","guid":{"rendered":"http:\/\/mylivia.com\/?p=263975"},"modified":"2020-09-10T13:57:58","modified_gmt":"2020-09-10T10:57:58","slug":"5-reasons-why-we-should-talk-about-periods-at-work-and-school","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/5-reasons-why-we-should-talk-about-periods-at-work-and-school\/","title":{"rendered":"5 Reasons Why We Should Talk About Periods at Work and School"},"content":{"rendered":"\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img width=\"1024\" height=\"683\" src=\"https:\/\/mylivia.com\/wp-content\/uploads\/2020\/09\/5reasonsblog-1024x683.jpg\" alt=\"\" class=\"wp-image-263976\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2020\/09\/5reasonsblog-1024x683.jpg 1024w, https:\/\/mylivia.com\/wp-content\/uploads\/2020\/09\/5reasonsblog-300x200.jpg 300w, https:\/\/mylivia.com\/wp-content\/uploads\/2020\/09\/5reasonsblog-768x512.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2020\/09\/5reasonsblog-600x400.jpg 600w, https:\/\/mylivia.com\/wp-content\/uploads\/2020\/09\/5reasonsblog.jpg 1101w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure><\/div>\n\n\n\n<p class=\"has-text-align-center has-small-font-size\"><\/p>\n\n\n\n<p>The following post is a guest blog post written by our friends at <a href=\"https:\/\/www.natracare.com\/\">Natracare<\/a>.<\/p>\n\n\n\n<p>Across the globe, people with periods have been conditioned to feel shame about their menstruation. In fact, over 90% worry about going to school during their time of the month, often for risk of leaking and being made fun of by their peers. This shame doesn’t stop when they become adults and move into the professional world either – did you know that <a href=\"https:\/\/metro.co.uk\/2019\/11\/15\/a-third-of-men-think-its-unprofessional-to-talk-about-periods-at-work-11149780\/\">a third of CIS men think it’s unprofessional for us to talk about periods at work<\/a>?<\/p>\n\n\n\n<p>We’re here to tell you that we disagree! Our periods are a perfectly normal, regular part of a lot of people’s lives. Periods shouldn’t have to be ignored, shoved under the carpet, or treated as something we should be ashamed of. That’s why we started <a href=\"https:\/\/www.change.org\/p\/walmart-call-on-supermarkets-to-stop-using-feminine-hygiene-to-describe-period-products?utm_source=share_petition&amp;utm_medium=custom_url&amp;recruited_by_id=d3de3200-e855-11ea-b69a-13a63bf5c497\">this petition<\/a>. We actually think there are a bunch of benefits to talking about your period – in the office, at school, on the bus… &#8211; wherever you are! Here they are:<\/p>\n\n\n\n<p><strong><em><span class=\"has-inline-color has-vivid-cyan-blue-color\">Smash the taboo<\/span><\/em><\/strong><br>One of the reasons a period taboo still exists is because it’s treated like a secret – the less people talk about something, the more uncomfortable it feels when somebody brings it up. It’s like when you go on holiday and the temperature feels uncomfortable at first, but a couple of days of being exposed to the heat means you get used to it. The best thing we can do to reduce the stigma surrounding periods is to talk about them openly and frequently. <\/p>\n\n\n\n<p><strong><em><span class=\"has-inline-color has-vivid-cyan-blue-color\">Better education<\/span><\/em><\/strong><br>With communication, comes understanding. Not only can we talk to other people <em>with <\/em>periods to learn about similarities and differences between cycles, we can also talk to those <em>without<\/em> them, helping them to gain a better understanding of what happens to our bodies every month and why. Three quarters of children aren’t satisfied with the education on periods they receive, but after learning, they stop discussing periods altogether, putting their already insufficient period education to a grinding halt.<\/p>\n\n\n\n<p><strong><em><span class=\"has-inline-color has-vivid-cyan-blue-color\">For your safety<\/span><\/em><\/strong><br>If you’re suffering as a result of your period, and you need to ask for help or call in sick, you should be able to feel comfortable giving an honest answer about what you’re experiencing. Did you know that endometriosis takes an average of 7.5 years to diagnose? Talking about your period confidently, and with no reservations might help doctors get to the bottom of your pain faster. It will also help employers, colleagues or teachers to better understand the situation you’re in. Talking about your period more could help you to find a solution to your pain, keeping you safe.<\/p>\n\n\n\n<p><strong><em><span class=\"has-inline-color has-vivid-cyan-blue-color\">Bonding<\/span><\/em><\/strong><br>Your period shouldn’t be something you have to endure alone, and it can actually be a great way to feel closer to those around you. Whether they go through the same thing (they know the feeling!) or help you to make your period that little bit easier to manage (thank GOD they’re in our lives), periods are better when you can talk about them with the people you’re surrounded by.<\/p>\n\n\n\n<p><strong><em><span class=\"has-inline-color has-vivid-cyan-blue-color\">Why not?<\/span><\/em><\/strong><br>Repeat after us: There is nothing gross about periods.<\/p>\n\n\n\n<p>So, if you want to moan about your cramps, explain why you’re a little teary, or give an honest reason why you can’t come into work. We say: why on earth not?! We all know periods happen, they’re entirely normal, and around half of us experience them month on month, so there shouldn’t be a problem when it comes to talking about them.<\/p>\n\n\n\n<p>At Natracare, we don’t think it’s important to just talk about periods openly, we believe it’s also essential to discuss the period products we use, and more precisely: what’s in them. Our <a href=\"https:\/\/www.natracare.com\/products\/\">period products<\/a> are plastic free, vegan and biodegradable – better for your vagina and the planet!<\/p>\n\n\n\n<p>Natracare started in 1989 when founder, Susie Hewson, created the world’s first 100% organic cotton tampon. Since then, Natracare has been designing and producing products that are kind to our bodies and the planet. Natracare products are plastic free, biodegradable, and compostable, just the way they should be!<\/p>\n\n\n<p><!--StartFragment--><\/p>\n<p><!--EndFragment--><\/p>","protected":false},"excerpt":{"rendered":"<p>The following post is a guest blog post written by<\/p>\n","protected":false},"author":11,"featured_media":263976,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/263975"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/11"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=263975"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/263975\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/263976"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=263975"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=263975"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=263975"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}