{"id":402475,"date":"2021-05-18T16:22:06","date_gmt":"2021-05-18T13:22:06","guid":{"rendered":"https:\/\/mylivia.com\/?p=402475"},"modified":"2021-05-18T16:45:44","modified_gmt":"2021-05-18T13:45:44","slug":"period-cups-a-how-to-guide-for-beginners","status":"publish","type":"post","link":"https:\/\/mylivia.com\/blog\/period-cups-a-how-to-guide-for-beginners\/","title":{"rendered":"Period Cups | A How-To Guide for Beginners"},"content":{"rendered":"\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-medium is-resized\"><img src=\"https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920-300x200.jpg\" alt=\"\" class=\"wp-image-402490\" width=\"479\" height=\"320\" srcset=\"https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920-300x200.jpg 300w, https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920-1024x683.jpg 1024w, https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920-768x512.jpg 768w, https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920-1536x1025.jpg 1536w, https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920-600x400.jpg 600w, https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920-90x60.jpg 90w, https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920-135x90.jpg 135w, https:\/\/mylivia.com\/wp-content\/uploads\/2021\/05\/cup-3155655_1920.jpg 1920w\" sizes=\"(max-width: 479px) 100vw, 479px\" \/><\/figure><\/div>\n\n\n\n<p>Thinking about making the switch or starting off strong with period cups? Discover the best options for your body, wallet, and the environment.<\/p>\n\n\n\n<h3>How periods affect the environment<\/h3>\n\n\n\n<p>Most people don’t realize how big of an impact single-use period products have on the environment. The average menstruator menstruates for around 40 years, which equates to about 2,400 periods in their lifetime. On any given day, there are about 800 million people menstruating and a lot of them are still using single-use period products.<\/p>\n\n\n\n<p>The average person will use roughly 20 pads or tampons each period, excluding the many panty liners used in case of leaks. The plastic used from applicators and packaging ends up adding to the pollution in our oceans and not just on a minor scale. In fact, you’re more likely to find period plastic washed up on the beach than you are likely to find plastic straws or single-use coffee filters. In Europe, pads and tampons are among the top 5 most common plastics found in the ocean, and that’s something nobody would like to be swimming around in.<\/p>\n\n\n\n<p>Luckily there are more products being designed that are not only better for the environment, but better for your body. There are period cups designed from 100% body-safe silicone for different flows, body types and life stages, and they can last for up to many years. There are also reusable period panties that can be thrown in the washing machine. You’re not just limited to one product either, find the winning combination that works for you and your changing needs.&nbsp;<\/p>\n\n\n\n<p>It’s important to teach new menstruators about the options available so that they can find some that work for them, and it’s just as important to teach seasoned period pros that it’s never too late to find something that works <em>better<\/em> for them.<\/p>\n\n\n\n<h3>Genius ways to relieve period pain<\/h3>\n\n\n\n<p>The most common ways to relieve period pains are with pain medication, but they mostly act as “band-aids” for body and headaches. The more we learn about shared period experiences and PMS symptoms, the more we’ve also discovered alternative and sometimes more effective ways of preventing and treating pains and aches.&nbsp;<\/p>\n\n\n\n<ul><li><strong>Livia wearables. <\/strong>These look like the small things physical therapists stick on your body to relax your muscles, and that’s exactly what they do. Livia wearables are designed with electrode gel pads that you can wear under your waistband. They send a pulse that keeps your nerves “busy” so that they don’t focus on pain, meanwhile you can carry on with your day without feeling a thing. It doesn’t get much better than that.<\/li><li><strong>Heating bottles.<\/strong> Heat can sooth pain by increasing blood flow to loosen muscles. The most common place they help is on the lower abdomen or lower back. Heat can also help reduce swelling and inflammation.<\/li><li><strong>Exercise.<\/strong> While getting active sounds like the last thing you’ll be wanting to do while enduring bloating and pain, moving your body can actually help minimize those aches. Start my stretching and doing some light yoga, but avoid inversions or anything that puts a lot of strain on the stomach and back.&nbsp;<\/li><li><strong>Change in diet.<\/strong> There are different foods for different times of your menstrual cycle. While menstruating, it’s a good idea to avoid foods that are high in salt because they can cause even more bloating. Likewise, try minimizing your caffeine intake. Try drinking extra water and eating leafy greens, chicken, and dark chocolate (see, we don’t have to get rid of ALL the good stuff) and see how you feel. Altering what you eat even slightly can prevent a lot of pain during periods.<\/li><\/ul>\n\n\n\n<h3>How to use period cups<\/h3>\n\n\n\n<p>The concept of using a period cup is simple: place the cup in your vaginal canal and it will hold your blood until you remove it for emptying. However, it may not be something you master on your first try. Here are some tips to keep in mind to speed up the learning process.<\/p>\n\n\n\n<ol><li>Wash your hands! Inserting and removing a menstrual cup requires you to insert two fingers into the vagina so make sure your hands are clean.<\/li><li>There are different techniques on how to hold the cup before inserting it. You can roll it up as if you&#8217;re rolling up a yoga mat and then insert it, or you can fold it into a taco shape and then insert it. You can also fold the edges inward as if you’re folding a corner and then insert it.&nbsp;<\/li><li>A very important step is making sure you create the seal for your cup so that it doesn’t leak. Simply run your index finger around the edge of the cup while it’s inserted. Then, with two fingers, twist the cup until it slides into place.&nbsp;<\/li><li>Most menstrual cups have a trimmable stem, which means you can cut it to fit the perfect height for your cervix. To measure your cervix, you can insert two clean fingers into the vagina until you feel around for the soft inner wall. Mark your fingers, then remove them and measure!&nbsp;<\/li><\/ol>\n\n\n\n<h3>Pros of using menstrual cups<\/h3>\n\n\n\n<p>They’re healthy for your body. Menstrual cups made from body-safe silicone are a lot less likely than pads and tampons to cultivate bacteria in the vagina.&nbsp;<\/p>\n\n\n\n<p>They save you up to $6,000 compared to single-use period products. You deserve that money!<\/p>\n\n\n\n<p>You never have to worry about running out of period supplies. One cup can last you up to 8 years. Boil it between periods to keep it in prime condition.<\/p>\n\n\n\n<p>It’s better for the environment. No more swimming around tampon applicators. And no more worrying about leaking in your bikini while swimming either.<\/p>\n\n\n\n<h3>Cons of using menstrual cups<\/h3>\n\n\n\n<p>Navigating menstrual cups in a shared bathroom can be tricky, but luckily there are even solutions for that! You can now find menstrual cup wipes pretty much anywhere that menstrual cups are sold.<\/p>\n\n\n\n<p>It can be a struggle to find the perfect fitting cup, but there are plenty of guides that can help you find the right cup for your body type and physical requirements.&nbsp;<\/p>\n\n\n\n<p>To learn more about the benefits of period cups, check out <a href=\"https:\/\/www.intimina.com\/\">INTIMINA<\/a> products and even discover the world’s first sex-friendly period cup &#8211; <a href=\"https:\/\/www.intimina.com\/ziggy-cup\">Ziggy Cup<\/a>. Enjoy all of life’s pleasures without the stress!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Thinking about making the switch or starting off strong with<\/p>\n","protected":false},"author":11,"featured_media":402490,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[270],"tags":[],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/402475"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/11"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=402475"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/posts\/402475\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media\/402490"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=402475"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/categories?post=402475"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/tags?post=402475"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}