{"id":138,"date":"2017-10-31T16:14:47","date_gmt":"2017-10-31T14:14:47","guid":{"rendered":"http:\/\/mylivia.com\/?page_id=138"},"modified":"2020-03-30T19:19:29","modified_gmt":"2020-03-30T16:19:29","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/mylivia.com\/terms-of-use\/","title":{"rendered":"Terms of Use"},"content":{"rendered":"<p>IMPORTANT: BY USING THE SERVICES (AS DEFINED BELOW) YOU INDICATE YOUR ACCEPTANCE OF THE FOLLOWING TERMS AND CONDITIONS. IF YOU DO NOT ACCEPT THE TERMS AND CONDITIONS SET FORTH HEREIN, THEN PLEASE DO NOT USE THE SERVICES.<\/p>\n<p><strong>Acceptance of Terms<\/strong><\/p>\n<p>The following consists of the terms and conditions (“<strong>Terms of Use<\/strong>“) governing the access to IPulse Medical Ltd. (“<strong>Company<\/strong>”, “<strong>we<\/strong>”, or “<strong>us<\/strong>”) web site (the “<strong>Site<\/strong>” or “<strong>My Livia<\/strong>“), including without limitation, the services, content, texts, graphics, logos, trademarks, service marks, designs, links, downloadable content, information, tools, features, functionality and copyright protected content and material, available on the Site (the “<strong>Services<\/strong>”). By accessing this Site, you acknowledge that you have read, understand, and agree to abide by the terms described herein. If you do not understand or agree to these terms, you should immediately exit this Site. If you continue using this Site you accept and agree to these Terms of Use.<\/p>\n<p>These Terms of Use are a binding agreement between you and the Company. Your use of this Site is governed by the version of the Terms of Use in effect on the date this Site is accessed by you. The Company may modify these Terms of Use at any time and without prior notice. You should review the most current version of this document by visiting: http:\/\/mylivia.com\/<\/p>\n<p><strong>About the Information on this Site<\/strong><\/p>\n<p>This Site is funded and operated by the Company. The information on this Site is for your general information only. Information you read on this Site cannot replace the relationship that you have with your health care professional. The Company does not practice medicine or provide medical services or advice and the information on this Site should not be considered medical advice. You should always talk to your health care professional for diagnosis and treatment.<\/p>\n<p>Please note that you may see information on this Site about products or therapies that are not available, authorized or approved in your country.<\/p>\n<p><strong>Title &amp; Ownership<\/strong><\/p>\n<p>All Intellectual Property Rights (hereinafter defined) evidenced by or embodied in and\/or attached\/connected\/related to the Site, the Services and\/or the Products are and shall be owned exclusively by the Company or its licensors, subsidiaries, affiliates or representatives (“<strong>Representatives<\/strong>”) unless expressly stated otherwise. These Terms of Use do not convey to you an interest in or to the Site, but only a limited right of use revocable in accordance with the terms of these Terms of Use. The rights granted by these Terms of Use are limited to those expressly stated herein, and no additional rights or licenses are being granted by implication or otherwise. “<strong>Intellectual Property Rights<\/strong>” means worldwide (a) patents, patent applications and patent rights; (b) rights associated with works of authorship, including copyrights, copyright applications, copyright restrictions, mask work rights, mask work applications and mask work registrations; (c) rights relating to the protection of trade secrets and confidential information; (d) rights analogous to those set forth herein and any other proprietary rights relating to intangible property; and (e) divisions, continuations, renewals, reissues and extensions of the foregoing (as applicable) now existing or hereafter filed, issued, or acquired. The compilation of all content on this Site is the exclusive property of the Company and\/or its Representatives and protected by copyright laws. Any unauthorized copying, reuse, reproduction or distribution of the abovementioned copyrighted materials, without obtaining the Company’s prior written consent, is strictly forbidden. All software and other related Intellectual Property Rights used on this Site are the property of the Company or its Representatives and protected by copyright laws.<\/p>\n<p><strong>Eligibility<\/strong><\/p>\n<p>Without limiting the foregoing, the Services and Site are not available where they are illegal to use, and the Company reserves the right to refuse and\/or cancel services to anyone at its own discretion.<\/p>\n<p>Because of the global nature of the Internet, you agree to comply with all local rules regarding online conduct, including all laws, rules, codes and regulations of the country in which you reside and the country from which you access this Site.<\/p>\n<p>IF YOU DO NOT QUALIFY OR COMPLY, DO NOT USE THIS SITE.<\/p>\n<p><strong>Site Store<\/strong><\/p>\n<p>The Company may offer Products for sale on the Site. Unless stated otherwise on the Site, all prices are in the stated currency in the webpage and other than shipment which is included in such prices, the prices of the Products are excluding any taxes (including VAT, as and if applicable), costs for storage, transportation and insurance, which are payable by you over and above the listed price. All prices may change from time to time without prior notice at the Company’s sole discretion. The applicable price in respect of a specific purchase is the price presented on the Site (and\/or on PayPal) upon completion of the purchase. If the prices are changed before the purchase is completed, you will be charged the new prices. The inventory of all Products offered on the Site is limited and it is possible that at the time of purchase the requested item will not be available. The Company reserves the right to change and\/or remove the list of items offered for purchase or close the Site store at any time and at its sole discretion and nothing herein shall be deemed as an obligation to offer any items for sale.<\/p>\n<p>The “Products” means the items detailed in the appropriate section of the sales\/order form and is a core term of the contract between us that any and all ancillary items are additional to such contract unless otherwise specified within the sales invoice\/order form.<\/p>\n<p>In order to make a purchase through the Site the user may be requested to select a password and to type in basic details such as his name, address, electronic mail address, telephone number and credit card number. In order for the order to be handled quickly and hassle free, one must ensure to remit correct details otherwise We will not be able to guarantee that the order be processed (“<strong>Placing the Order<\/strong>”). Your attention is drawn to the fact that knowingly remitting false details may be considered a criminal offense. Civil and criminal legal measures may be taken against those submitting false details, including but not limited to a claim in torts for damages the Company sustains due to obstructions relating to the operation of the website. Likewise, the information that is remitted by the user through the Site  will serve, inter alia to send electronic mail concerning special offers or updates to the website, only after receiving the user’s permission to do so. The Company  reserves the right to limit the number of items in each order.<\/p>\n<p>After Placing the Order, you will receive an email from us acknowledging that we have received your order for the Products. Please note that this does not mean that your order has been accepted. Your order constitutes an offer to us to buy Products. All orders are subject to acceptance by us (which approval will be subject, <em>inter alia<\/em>, to receipt by the Company of an approval from the credit card companies that the charge has been approved in accordance with the work procedures in effect between them and the Company), and we will confirm such acceptance to you by sending you an email that confirms that the Products have been dispatched by the delivery service provider (the “<strong>Dispatch Confirmation<\/strong>”). The contract between you and us will only be formed when we send you the Dispatch Confirmation. The contract will relate only to those Products whose dispatch we have confirmed in the Dispatch Confirmation. We will not be obliged to accept your registration as a user in the Site, accept your order nor to supply any other Products which may have been part of your order until the dispatch of such Products has been confirmed in a separate Dispatch Confirmation.<\/p>\n<p><strong>Service Options<\/strong><\/p>\n<p>We offer two methods of service: (i) One Time Purchase; and (ii) Subscription.<\/p>\n<p>Please refer to our Site to see the specific and additional conditions of each method of purchase.<\/p>\n<p>We may also offer special promotional plans, memberships, or services, including offerings of third-party products and services in conjunction with or through the Service. We are not responsible for the products and services provided by such third parties. We reserve the right to modify, terminate or otherwise amend our offered subscription plans and promotional offerings at any time in accordance with these Terms.<\/p>\n<p><strong>Cancellation <\/strong><\/p>\n<p><strong>Subscription<\/strong>: Subscription services require a four month minimum subscription.  You may return your Product and cancel the subscription at any time after 4 months.<\/p>\n<p><strong>One Time Purchase:<\/strong> If you purchased Products on the Site store and wish to cancel the transaction and to receive a refund of your purchase prior to the shipping date, you may do so by submitting a cancelation request to info@mylivia.com. The cancelation after the shipping is subject to the following terms and conditions. The Company will make reasonable efforts to refund the price paid (not including the costs for the first shipment) within reasonable time, after deduction of shipment costs, service fees and expenses as permitted by applicable law. Following are the conditions for cancelation: (a) you may send the Company a cancelation request within fourteen (14) business days from the day you received the item with a copy of the receipt and\/or order reference to the aforementioned email, the cancelation request must specify the order number, purchased item, price paid and reason for cancelation; (b) you may not cancel your purchase if the item has been damaged or used; (c) you may not cancel any purchase of items that may be duplicated unless they arrived packed and you did not open their package; (d) cancelation is subject to returning the item in its original state to the Company. Refunds (if made) will be issued in the same method of payment as the original payment. The Company will use commercially reasonable efforts to ensure that any such refund will be made within 30 business days of receipt of the Products returned. Without derogating from any other limitation of liability clauses in these Terms of Use, cancelation of the transaction in the conditions as detailed above will be the sole and exclusive remedy you will be entitled for from the Company in connection with any Products purchased from the Site store. Other than cancelation (pursuant to the aforementioned terms) you will not have any other claim or demand of any kind against the Company and\/or any one on its behalf. Notwithstanding the aforementioned a cancellation is not applicable for an order of any sort of intangible digital content (including without limitation apps).<\/p>\n<p>We reserve the right to cancel your order for any reason whatsoever and without any explanation.<\/p>\n<p>If we do cancel your contract, we will notify you by email and will refund the price paid as soon as possible but in any event within 30 days of your order. We will not be obliged to offer any additional compensation for disappointment suffered, or any other claim or demand.<\/p>\n<p><strong>Delivery and Shipping<\/strong><\/p>\n<p>Shipment is limited only to destinations stated on the Site.<\/p>\n<p>After a purchase is processed and the full payment is received by the Company, the Company will send you a receipt by email, as required by law, (by submitting an order on the Site you agree to receive the receipt by email) and engage the services of a third party carrier (at the sole discretion of the Company) to send the purchased item to the address provided by you to the Site store or PayPal. Orders on the Site are limited to the distribution regions of the third party carrier. These services may not be available in certain countries. If you submit an order from one of these countries and your payment is transferred to the Company, we will refund these payments to you and your order will be canceled and you shall not have any other claim or demand in respect of the distribution limitation and or with the cancellation of the order. Your payment will be deemed received only after it will be transferred to the Company’s bank or PayPal account, as the case may be. The Company will not be liable or responsible for any difficulties or failures in transferring the payment, and if such failures or difficulties occur please contact PayPal or your credit card company directly. It is hereby clarified that the Products will be sent only after receiving full payment of the purchase by the Company. Payments due hereunder shall not be subject to any set-off for claims by you. In addition, you agree to pay all costs of collection, including costs of litigation and attorneys’ fees. Company reserves the right to declare all payments immediately due and payable hereunder for any breach of these Terms and Conditions including, without limitation, failure to comply with credit terms.<\/p>\n<p>Company may limit, at its own discretion, the quantities ordered per user and only execute partial deliveries. In such cases the relative amount shall be paid back to user. The user agrees to accept such partial deliveries.<\/p>\n<p>If the shipping address you provided was correct and in spite of this the carrier failed to complete the shipment, you may request that the Company re-execute the shipment (this is applicable only for orders of up to three (3) items). If the third party carrier will fail to ship and\/or the shipment will be delayed as a result of your unavailability at the time of shipment and\/or inaccuracies in the details provided by you to the Company or the third party carrier, the Company may charge you with additional shipment and service costs. All items purchased from the Company are made pursuant to a shipment contract. Delivery shall be complete EXW (2020) Company premises. This means that the risk of loss and title for such items pass to you upon our delivery to the carrier. Notwithstanding anything to the contrary, the Company will not be liable or responsible for any damage, loss or delay due to a default or failure in shipment. You hereby acknowledge that in respect of any such shipment related claim you may contact the third party carrier subject to its terms and conditions.<\/p>\n<p>The Company will make reasonable efforts to have a third party carrier deliver all orders within 7-21 business days from the day you received the shipping confirmation.<\/p>\n<p>Shipping costs for uncollected packages will not be paid by us. We will charge you for the cost of return shipping and administrative costs.<\/p>\n<p><strong>Use of Products<\/strong><\/p>\n<p>Products are supplied only to correspond to the purpose which is explicitly demonstrated and explained in the Site and\/or in the leaflet manual, provided to the user whether in hard copy which shall arrive along with the Product or whether in a digital form, and not for any alternative uses to which they may be put. We shall accept no liability for any failure of Products due to any such alternative use, including reduction of pains in any other part of the body.  Any Products or parts of them that are modified, adapted by you or any third party shall no longer be warranted by the manufacturer nor shall we be liable for any failures resulting from any such modification or adaptation. The use of the Product, according to these Terms of Use, shall be for personal use only and not for commercial purposes.<\/p>\n<p><strong>Usage Responsibility. Consultation with a Doctor<\/strong><br \/>\nThe Products shall be used exclusively and responsibly by the user, in accordance with the accompanying leaflet manual, with Company excluding responsibility for use.<\/p>\n<p><strong>Service Access<\/strong><\/p>\n<p>If this Site or Service was not available for any period or any time, we shall not be liable. We give no warranties as to the accessibility performance availability, or of the Site or the Service. Temporary suspension of access to this Site or Service may occur without notice at our discretion including without limitation in the case of repair, maintenance, system failure or for reasons beyond our control. The Company reserves the right to suspend the operation of the Service, its Site or any part thereof.<\/p>\n<p>You agree that neither the Company nor its third party providers will be liable to you in any way for the termination, suspension, interruption, delay of any of the services and products on the Site.<\/p>\n<p><strong>Trademarks and Service marks<\/strong><\/p>\n<p>My Livia, Livia, www.mylivia.com the logo, and other graphics, logos, page headers, button icons, scripts, and service names are trademarks, certification marks, service marks, or other trade dress of the Company or its affiliates, including their trademarks, certification marks, service marks, and trade dress have inherent meaning and substantial value because of their restricted use. They may not be used in connection with any product or service that is not the Company’s or its affiliates’, in any manner without Company’s permission. All other trademarks not owned by Company or its affiliates that appear on the Site are the property of their respective owners, who are not affiliated with, connected to, or sponsored by the Company or its affiliates and may not be used other than as permitted by their respective owners.<\/p>\n<p><strong>Privacy Policy<\/strong><\/p>\n<p>The Company recognizes and respects the importance of protecting the privacy of all information provided by users. The Company collects and stores information about its users. Please read our Privacy Policy available at: http:\/\/mylivia.com\/<\/p>\n<p><strong>Removal of Infringing Content<\/strong><\/p>\n<p>If you believe that any content of the Site (the “<strong>Content<\/strong>“), including without limitation Content defined as your content, any third party logos, trademarks, brands or other intellectual property infringes upon your intellectual property rights, please send us a detailed notice to info@mylivia.com, including the details set forth below, we will make reasonable commercial efforts to remove such Content, locate the infringer and notify him of your complaint. For efficient removal your notice should consist of the following: a physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed; identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works on the Site are covered by a single notification, a representative list of such works at that Site; identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit the Company to locate the material; providing URLs in the body of an email is the best way to help us locate content quickly; information reasonably sufficient to permit the Company to contact the complaining party, such as address, telephone number, and, if available, electronic mail address at which the complaining party may be contacted; a statement that the complaining party has a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law and a statement that the information in the notification is accurate, and under penalty of perjury, that the complaining party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.<\/p>\n<p><strong>Links to Other Web Sites<\/strong><\/p>\n<p>This Site may contain links to web sites not operated by Company. We provide these links for your convenience, but we do not review, control, or monitor the materials on any other web sites. We are not responsible for the performance of those web sites or for your business dealings with them. Your use of other web sites is subject to the terms of use of those web sites, including the privacy policies of those web sites.<\/p>\n<p><strong>Warranty and Disclaimers<\/strong><\/p>\n<p>Company warrants to you that a Product supplied to you hereunder shall be free from material defects in material and workmanship, subject to normal use and service, for a period of 24 months from the date of delivery of the Products to you (the “<strong>Warranty Period<\/strong>“). In addition, this warranty does not apply to any software related to the Products, which is provided “AS IS”, without warranty of any kind or to any other replaceable components of the Product, other than its electric hardware. Subject to the foregoing, your exclusive remedy and Company’s sole liability for any failure of a Product to conform to the above warranty (“<strong>Defect<\/strong>” and “<strong>Defective<\/strong>”, as applicable) will be for Company to repair or replace, at its option, any such Defective Product, free of charge, provided: (i) you promptly notify Company, in writing, upon discovery of any Defect, in which case Company will issue a Return Material Authorization (“RMA”) number to you; (ii) you return to the Company such Defective Products to a receiving point designated by the Company with transportation charges prepaid by you, within thirty (30) days of the issue date of an authorized RMA number, with the RMA number prominently displayed on the container for such Product (and any Product returned without a valid RMA number will be sent back to you at your expense and risk of loss or damage); (iii) the Defective Product is received by you within the Warranty Period; and (iv) Company’s evaluation of the Product discloses to its satisfaction, that the Product is in fact Defective and that such Defect is not due to: (1) any misuse, abuse, neglect, or any negligence of any person other than the Company; (2) any repair or alteration of the Product by anyone other than an authorized representative of the Company; (3) improper design, maintenance, installation or service, operation or use contrary to furnished instructions; (4) improper transportation, storage or testing of, or improper environment for, the Product; (5) unusual physical or electrical stress or accident; (6) any Force Majeure Event (defined herein below); or (7) any combination of the Product with a product not authorized by Company.<\/p>\n<p>THE FOREGOING WARRANTY IS THE SOLE WARRANTY MADE OR DEEMED MADE BY OR ON BEHALF OF THE COMPANY. TO THE FULLEST EXTENT PERMITTED UNDER APPLICABLE LAW, COMPANY EXPRESSLY DISCLAIMS ALL OTHER WARRANTIES, WHETHER STATUTORY, EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ALL IMPLIED WARRANTIES OF MERCHANTABILITY, SATISFACTORY QUALITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, ANY WARRANTIES THAT MAY ARISE BY REASON OF USAGE OF TRADE, CUSTOM, COURSE OF DEALING OR COURSE OF PERFORMANCE OR OTHERWISE WHICH WOULD EXTEND BEYOND THE WARRANTY CONTAINED HEREIN. THE COMPANY DOES NOT WARRANT THAT THE OPERATION OF THE PRODUCTS WILL BE UNINTERRUPTED OR ERROR-FREE. YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT COMPANY IS NOT AND WILL NOT BE LIABLE FOR ANY ACTUAL OR ALLEGED INFRINGEMENT OR MISAPPROPRIATION OF ANY PATENT RIGHT, COPYRIGHT, TRADE SECRET RIGHT OR OTHER PROPRIETARY RIGHT OF ANY THIRD PERSON BY ANY USE OR SALE OF ANY PRODUCT.<\/p>\n<p>You represent and warrant that (a) all of the information provided by you to our Site to participate in the Service is correct and current; and (b) you have all necessary right, power and authority to enter into these Terms of Use and to perform the acts required of you hereunder.<\/p>\n<p>You hereby accept and agree that it is beyond our control, and no duty to take any action regarding: which users gain access to the Site or use the Services; what effects the Content may have on you; how you may interpret or use the Content; or what actions you may take as a result of having been exposed to the Content. You release us from all liability for you having acquired or not acquired Content through the Site or the Services.<\/p>\n<p>It should be noted that the Site or Services may contain, or direct you to sites containing, information that some people may find offensive or inappropriate. We make no representations concerning any content contained in or accessed through the Site or Services, and we will not be responsible or liable for the accuracy, copyright compliance, legality or decency of material contained in or accessed through the Site or the Services.<\/p>\n<p>SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF CERTAIN WARRANTIES OR CONDITIONS, SO SOME OF THE ABOVE EXCLUSIONS MAY NOT APPLY TO YOU<strong>.<\/strong><\/p>\n<p>YOU UNDERSTAND AND AGREE THAT YOU USE, ACCESS, DOWNLOAD, OR OTHERWISE OBTAIN INFORMATION, MATERIALS, OR DATA THROUGH THE SITE OR ANY REFERENCE SITES AT YOUR OWN DISCRETION AND RISK AND THAT YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM) OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OR USE OF SUCH MATERIAL OR DATA.<strong> <\/strong><\/p>\n<p><strong>Limitation of liability<\/strong><\/p>\n<p>TO THE MAXIMUM EXTENT PERMITTED BY LAW, THE COMPANY AND ITS REPRESENTATIVES ARE NOT AND WILL NOT BE LIABLE, UNDER ANY LEGAL THEORY, WHETHER CONTRACT, TORT OR OTHERWISE, FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, OR EXEMPLARY DAMAGES, INCLUDING BUT NOT LIMITED TO, DAMAGES FOR LOSS OF PROFITS, REVENUE, INCOME, GOODWILL, USE, DATA OR OTHER INTANGIBLE LOSSES, EVEN IF THE COMPANY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES, OR TO PUNITIVE DAMAGES THAT RESULT FROM OR RELATE IN ANY MANNER WHATSOEVER, TO YOUR USE OF THE SERVICES AND\/OR THE COMPANY’S INELECTUAL POPERTY, OR RELIANCE ON ANY OF SERVICES AND\/OR THE COMPANY’S INTELLECTUAL PROPERTY, OR TO ANY ERRORS, INACCURACIES, OMISSIONS, DEFECTS, SECURITY BREACHES, OR ANY OTHER FAILURE TO PERFORM BY THE COMPANY. TO YOUR USE OF THE SERVICES AND\/OR THE COMPANY’S INTELLECTUAL PROPERTY, OR RELIANCE ON ANY OF SERVICES AND\/OR THE COMPANY’S INTELLECTUAL PROPERTY, OR TO ANY ERRORS, INACCURACIES, OMISSIONS, DEFECTS, SECURITY BREACHES, OR ANY OTHER FAILURE TO PERFORM BY THE COMPANY.<\/p>\n<p>IN NO EVENT SHALL THE AGGREGATE LIABILITY HEREUNDER OF THE COMPANY OR ITS AFFILIATES, FOR ANY CAUSE WHATSOEVER AND REGARDLESS OF THE BASIS OF THE FORM OF THE ACTION, EXCEED THE TOTAL PRICE ACTUALLY RECEIVED BY THE COMPANY FROM YOU FOR THE PRODUCTS THAT CAUSED THE DAMAGES, BUT IN ANY EVENT FOR NO MORE THAN A TOTALPURCHASE PRICE PAYABLE FOR 10 SINGLE UNITS OF THE PRODUCT (EVEN IF MORE THAN 10 SINGLE UNITS OF THE PRODUCT HAVE BEEN PURCHASED BY YOU)THE COMPANY AND\/OR ITS AFFILIATES SHALL NOT BE LIABLE FOR ANY LOSS OR DAMAGE WHICH MAY BE INCURRED AS A RESULT OF ANY DELAY OR FAILURE TO PERFORM ANY OF COMPANY’S OBLIGATIONS HEREUNDER DUE TO ANY CAUSE BEYOND ITS REASONABLE CONTROL, INCLUDING WITHOUT LIMITATION, ACCIDENTS, ACTS OF GOD, UNANTICIPATED NATURAL PHENOMENON, LABOR DISPUTES, VENDOR FAILURE, STRIKES OR INDUSTRIAL DISTURBANCES, ANY ACT OF ANY GOVERNMENT OR AGENCY THEREOF, OR ANY JUDICIAL ACTION, WAR, PUBLIC DISTURBANCE OR RIOTS, DELAYS IN TRANSPORTATION, WEATHER, EPIDEMIA AND PANDEMIA, UTILITY OR COMMUNICATION FAILURE (“<strong>FORCE MAJEURE EVENT<\/strong>“).<\/p>\n<p>In the event of any such excused delay or failure of performance, the date of delivery shall, at Company’s request, be deferred for a period equal to the time lost by reason of the delay. Company shall notify you of any such event or circumstance within a reasonable time after it learns of same.<\/p>\n<p>YOU RECOGNIZE AND AGREE THAT THE WARRANTY DISCLAIMERS AND LIABILITY AND REMEDY LIMITATIONS IN THESE TERMS ARE MATERIAL BARGAINED FOR BASIS OF THESE TERMS AND THAT THEY HAVE BEEN TAKEN INTO ACCOUNT AND REFLECTED IN DETERMINING THE DECISION BY YOU TO ENTER INTO THESE TERMS and that you are aware and agree that the warranty does not include accessories, but only the device itself.<\/p>\n<p><strong>Indemnification<\/strong><\/p>\n<p>You agree to indemnify, defend and hold harmless the Company, its officers, directors, employees, stockholders, Representatives and suppliers, from and against any and all claims, liabilities, damages, losses or expenses, including but not limited to attorney’s fees and costs, arising out of or in any way connected with your access to or use of this Site and\/or the Services.<\/p>\n<p><strong>Termination<\/strong><\/p>\n<p>You agree that the Company, in its sole discretion, and without penalty, may suspend or terminate your use of the Site, therefore  your Subscription to the site and\/or Services if you violate any of these Terms of Use. You agree that any termination of your access to the Site and\/or Services may be effected without prior notice, and you agree that the Company will not be liable to you or any third party for any such termination. Any suspected fraudulent, abusive or illegal activity may be referred to appropriate law enforcement authorities. These remedies are in addition to any other remedies the Company may have at law, contract or otherwise.<\/p>\n<p><strong>Miscellaneous<\/strong><\/p>\n<p>Changes. The Company reserves the right, at its discretion, to modify these Terms of Use with or without notice. Notice may be provided by posting the latest changes on the Site or at Company’ s discretion by email. Your continued use of this Site following the changes will mean you accept those changes. You should review the most current version of this document by visiting www.mylivia.com.<\/p>\n<p>Waiver. The failure of the Company to exercise or enforce any right or provision of these Terms of Use will not constitute a waiver of such right or provision. Any waiver of any provision of these Terms of Use will be effective only if in writing and signed by the Company.<\/p>\n<p>Applicable Law and Jurisdiction. These Terms of Use are governed by the laws of Israel, without regard to the conflict of laws provisions thereof. The exclusive jurisdiction and venue of any action with respect to these Terms of Use shall be the competent courts residing in Tel-Aviv, Israel and the Company and you hereby submit to the exclusive jurisdiction and venue of such courts for the purpose of any such action<strong>.<\/strong><\/p>\n<p>Severability. If any provision of these Terms of Use is held to be unlawful, void, or for any reason unenforceable, then that provision will be limited or eliminated from these Terms of Use to the minimum extent necessary and will not affect the validity and enforceability of any remaining provisions.<\/p>\n<p>Assignment. These Terms of Use, and any rights and licenses granted hereunder, may not be transferred or assigned by you, but may be assigned by the Company without restriction. Any assignment attempted to be made in violation of this Terms of Use shall be void.<\/p>\n<p>Survival. Upon termination of these Terms of Use, any provision which, by its nature or express terms should survive, will survive such termination or expiration, including, but not limited to the following Sections: Title and Ownership, Trademarks and Service marks, Content and Links, Copyright, Disclaimers, Limitation of Liability, Indemnification and Miscellaneous.<\/p>\n<p>Headings. The heading references herein are for convenience purposes only, do not constitute a part of these Terms of Use, and will not be deemed to limit or affect any of the provisions hereof.<\/p>\n<p>Entire Agreement. This and the Privacy Policy attached hereto as an integral part hereof are the entire agreements between you and the Company relating to the subject matter herein and will not be modified except in writing, signed by both parties, or by a change to these Terms of Use by the Company as set forth herein.<\/p>\n<p>Last updated: March 2020<\/p>\n","protected":false},"excerpt":{"rendered":"<p>IMPORTANT: BY USING THE SERVICES (AS DEFINED BELOW) YOU INDICATE<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"page-contact.php","meta":[],"yst_prominent_words":[67,102,106,68,295,101,294,98,107,93,94,110,293,69,74,95,104,96,99,103],"_links":{"self":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/pages\/138"}],"collection":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/comments?post=138"}],"version-history":[{"count":0,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/pages\/138\/revisions"}],"wp:attachment":[{"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/media?parent=138"}],"wp:term":[{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/mylivia.com\/wp-json\/wp\/v2\/yst_prominent_words?post=138"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}